'''
    [문제]
        data의 각 숫자만큼 graph에 숫자1을
        세로로 위에서 아래로 채우시오.
    [정답]
        [1,1,1,1,1,1],
        [1,1,1,1,1,1],
        [1,1,1,0,1,1],
        [0,1,1,0,1,1],
        [0,1,1,0,1,0],
        [0,1,0,0,1,0],
        [0,1,0,0,1,0],
        [0,0,0,0,1,0],
        [0,0,0,0,1,0],
        [0,0,0,0,1,0],
'''

data = [3,7,5,2,10,4]

graph = [
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
    [0,0,0,0,0,0],
]

graph_x_idx = 0

for turns in range(len(data)):
    for fill in range(data[turns]):
        graph[fill][graph_x_idx] = 1
    graph_x_idx += 1

for i in range(len(graph)):
    print(graph[i])